---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RailingSystemTopRailTypesParam
source: html/01ed99e3-ee07-3c39-1fbc-5d2dc13f2ba9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RailingSystemTopRailTypesParam Property

"Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemTopRailTypesParam { get; }
```